app/views/people/index.html.erb

        <td><%= person.vehicle %></td>
        <td><%= person.locations.pluck(:name).join(', ') %></td>
        <td><%= person.affiliations.pluck(:name).join(', ') %></td>
---
SELECT "locations"."name" FROM "locations" INNER JOIN "locations_people" ON "locations"."id" = "locations_people"."location_id" WHERE "locations_people"."person_id" = ?  [["person_id", 1]]
SELECT "affiliations"."name" FROM "affiliations" INNER JOIN "affiliations_people" ON "affiliations"."id" = "affiliations_people"."affiliation_id" WHERE "affiliations_people"."person_id" = ?  [["person_id", 1]]