app/controllers/csv_import_controller.rb

INSERT INTO "locations" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Death Star, Tatooine"], ["created_at", "2023-10-19 00:40:55.409570"], ["updated_at", "2023-10-19 00:40:55.409570"]]
SELECT "locations".* FROM "locations" WHERE "locations"."name" = ? LIMIT ?  [["name", "Death Star, Tatooine"], ["LIMIT", 1]]
INSERT INTO "affiliations" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Sith"], ["created_at", "2023-10-19 00:40:55.427670"], ["updated_at", "2023-10-19 00:40:55.427670"]]
SELECT "affiliations".* FROM "affiliations" WHERE "affiliations"."name" = ? LIMIT ?  [["name", "Sith"], ["LIMIT", 1]]
---
  def create
    if params[:csv_file].present?
      # Process and import the CSV file here
      csv_data = params[:csv_file].read
      options = {headers: true, col_sep:','}
      CSV.foreach(params[:csv_file].path, **options) do |row|

        full_name = row['Name']
        location_name = row['Location']
        affiliation_name = row['Affiliations']

        # Split the full name into first and last name
        first_name, last_name = full_name.split

        person = Person.create(
          first_name: first_name,
          last_name: last_name,
          weapon: row['Weapon'],
          gender: row['Gender'],
          species: row['Species'],
          vehicle: row['Vehicle']
        )

        location = Location.find_or_create_by(name: location_name)
        person.locations << location

        affiliation = Affiliation.find_or_create_by(name: affiliation_name)